tap "homebrew/bundle"
tap "homebrew/services"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "buo/cask-upgrade"
brew "python@3.12"
brew "autojump"
brew "cowsay"
brew "datamash"
brew "fpp"
brew "fzf"
brew "gh"
brew "git"
brew "gnupg"
brew "goenv"
brew "htop"
brew "llvm"
brew "ispc"
brew "jid"
brew "jq"
brew "julia"
brew "neovim"
brew "pandoc"
brew "pinentry-mac"
brew "pnpm"
brew "pstree"
brew "ripgrep"
brew "tldr"
brew "tmux"
brew "tree"
brew "watch"
brew "wget"
cask "1password"
cask "appcleaner"
cask "arc"
cask "bartender"
cask "calibre"
cask "chatgpt"
cask "cleanshot"
cask "contexts"
cask "dash"
cask "discord"
cask "docker"
cask "dropbox"
cask "eudic"
cask "font-fira-code"
cask "google-chrome"
cask "iina"
cask "iterm2"
cask "intellij-idea-ce"
cask "itermai"
cask "logseq"
cask "mactex"
cask "nosqlbooster-for-mongodb"
cask "nutstore"
cask "pdf-expert"
cask "rapidapi"
cask "raycast"
cask "readdle-spark"
cask "slack"
cask "spotify"
cask "stash"
cask "telegram"
cask "the-unarchiver"
cask "ticktick"
cask "visual-studio-code"
cask "wechat"
cask "zoom"
vscode "aaron-bond.better-comments"
vscode "anbuselvan.vscode-symlink"
vscode "asvetliakov.vscode-neovim"
vscode "bierner.markdown-mermaid"
vscode "bradlc.vscode-tailwindcss"
vscode "chrisbibby.hide-git-ignored"
vscode "christian-kohler.npm-intellisense"
vscode "christian-kohler.path-intellisense"
vscode "dbaeumer.vscode-eslint"
vscode "dotjoshjohnson.xml"
vscode "eamodio.gitlens"
vscode "editorconfig.editorconfig"
vscode "equinusocio.vsc-material-theme"
vscode "equinusocio.vsc-material-theme-icons"
vscode "esbenp.prettier-vscode"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "golang.go"
vscode "gruntfuggly.todo-tree"
vscode "haskell.haskell"
vscode "huntertran.auto-markdown-toc"
vscode "intel-corporation.ispc"
vscode "james-yu.latex-workshop"
vscode "jebbs.plantuml"
vscode "jock.svg"
vscode "justusadam.language-haskell"
vscode "ms-azuretools.vscode-docker"
vscode "ms-python.black-formatter"
vscode "ms-python.debugpy"
vscode "ms-python.isort"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode.cmake-tools"
vscode "ms-vscode.cpptools"
vscode "ms-vscode.remote-explorer"
vscode "ms-vscode.remote-server"
vscode "mtxr.sqltools"
vscode "naumovs.color-highlight"
vscode "oderwat.indent-rainbow"
vscode "oracle.oracle-java"
vscode "pkief.material-icon-theme"
vscode "redhat.vscode-xml"
vscode "redhat.vscode-yaml"
vscode "rid9.datetime"
vscode "ritwickdey.liveserver"
vscode "sjhuangx.vscode-scheme"
vscode "spywhere.guides"
vscode "streetsidesoftware.code-spell-checker"
vscode "twxs.cmake"
vscode "xabikos.javascriptsnippets"
vscode "yzhang.markdown-all-in-one"
vscode "zxh404.vscode-proto3"
