tap "railwaycat/emacsmacport"
tap "sdkman/tap"
brew "git"
brew "asdf"
brew "autojump"
brew "bash"
brew "btop"
brew "clang-format"
brew "cmake"
brew "codespell"
brew "cowsay"
brew "datamash"
brew "eza"
brew "fd"
brew "fpp"
brew "fzf"
brew "gawk"
brew "gcc"
brew "gh"
brew "git-delta"
brew "gnupg"
brew "goenv"
brew "google-java-format"
brew "htop"
brew "llvm"
brew "ispc"
brew "jid"
brew "jq"
brew "julia"
brew "lazygit"
brew "luarocks"
brew "make"
brew "maven"
brew "neovim"
brew "pandoc"
brew "pinentry-mac"
brew "powerlevel10k"
brew "prettier"
brew "pstree"
brew "python@3.12"
brew "rclone"
brew "ripgrep"
brew "shellcheck"
brew "shfmt"
brew "spotify_player"
brew "stow"
brew "stylua"
brew "tlrc"
brew "tmux"
brew "tree"
brew "watch"
brew "wego"
brew "wget"
brew "yamlfmt"
brew "yq"
brew "railwaycat/emacsmacport/emacs-mac@29", args: ["with-imagemagick", "with-librsvg", "with-modern-icon", "with-native-compilation", "with-starter", "with-unlimited-select"]
cask "1password"
cask "appcleaner"
cask "arc"
cask "bartender"
cask "calibre"
cask "chatgpt"
cask "cleanshot"
cask "clion"
cask "contexts"
cask "dash"
cask "db-browser-for-sqlite"
cask "discord"
cask "docker-desktop"
cask "dropbox"
cask "eudic"
cask "font-fira-code"
cask "font-fira-code-nerd-font"
cask "font-fira-mono-nerd-font"
cask "font-hack-nerd-font"
cask "font-meslo-lg-nerd-font"
cask "font-symbols-only-nerd-font"
cask "google-chrome"
cask "iina"
cask "intellij-idea-ce"
cask "iterm2"
cask "itermai"
cask "karabiner-elements"
cask "logseq"
cask "mactex"
cask "microsoft-auto-update"
cask "microsoft-outlook"
cask "microsoft-teams"
cask "miniconda"
cask "nosqlbooster-for-mongodb"
cask "nutstore"
cask "pdf-expert"
cask "pycharm-ce"
cask "rapidapi"
cask "raycast"
cask "readdle-spark"
cask "sioyek"
cask "slack"
cask "spotify"
cask "squirrel-app"
cask "stash"
cask "tailscale-app"
cask "telegram"
cask "the-unarchiver"
cask "ticktick"
cask "visual-studio-code"
cask "vlc"
cask "webstorm"
cask "wechat"
cask "xquartz"
cask "zoom"
vscode "aaron-bond.better-comments"
vscode "anbuselvan.vscode-symlink"
vscode "bierner.markdown-mermaid"
vscode "bradlc.vscode-tailwindcss"
vscode "chrisbibby.hide-git-ignored"
vscode "christian-kohler.npm-intellisense"
vscode "christian-kohler.path-intellisense"
vscode "davidbwaters.macos-modern-theme"
vscode "dbaeumer.vscode-eslint"
vscode "docker.docker"
vscode "dotjoshjohnson.xml"
vscode "dracula-theme.theme-dracula"
vscode "editorconfig.editorconfig"
vscode "esbenp.prettier-vscode"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "golang.go"
vscode "gruntfuggly.todo-tree"
vscode "haskell.haskell"
vscode "huntertran.auto-markdown-toc"
vscode "intel-corporation.ispc"
vscode "james-yu.latex-workshop"
vscode "jebbs.plantuml"
vscode "jock.svg"
vscode "justusadam.language-haskell"
vscode "ms-azuretools.vscode-containers"
vscode "ms-azuretools.vscode-docker"
vscode "ms-python.black-formatter"
vscode "ms-python.debugpy"
vscode "ms-python.isort"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode.cmake-tools"
vscode "ms-vscode.cpptools"
vscode "ms-vscode.remote-explorer"
vscode "ms-vscode.remote-server"
vscode "mtxr.sqltools"
vscode "naumovs.color-highlight"
vscode "oderwat.indent-rainbow"
vscode "oracle.oracle-java"
vscode "pkief.material-icon-theme"
vscode "redhat.vscode-xml"
vscode "redhat.vscode-yaml"
vscode "rid9.datetime"
vscode "ritwickdey.liveserver"
vscode "sjhuangx.vscode-scheme"
vscode "spywhere.guides"
vscode "streetsidesoftware.code-spell-checker"
vscode "twxs.cmake"
vscode "vscodevim.vim"
vscode "xabikos.javascriptsnippets"
vscode "yzhang.markdown-all-in-one"
vscode "zxh404.vscode-proto3"
